In [22]:
import kagglehub
from kagglehub import KaggleDatasetAdapter

In [23]:
file_path = "C:\\Users\\GrowTech\\Desktop\\Data Science Batch-20\\Pandas\\Coffee_dataset.csv"

In [24]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("ayeshasiddiqa123/coffee-dataset")

print("Path to dataset files:", path)

Path to dataset files: C:\Users\GrowTech\.cache\kagglehub\datasets\ayeshasiddiqa123\coffee-dataset\versions\1

In [25]:
import pandas as pd
coffee = pd.read_csv("Coffe_sales.csv")

In [26]:
coffee.head()

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
0,10,card,38.7,Latte,Morning,Fri,Mar,5,3,2024-03-01,10:15:50.520000
1,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:19:22.539000
2,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:20:18.089000
3,13,card,28.9,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
4,13,card,38.7,Latte,Afternoon,Fri,Mar,5,3,2024-03-01,13:48:14.626000

In [27]:
coffee['coffee_name']

0               Latte
1       Hot Chocolate
2       Hot Chocolate
3           Americano
4               Latte
            ...
3542       Cappuccino
3543            Cocoa
3544            Cocoa
3545        Americano
3546            Latte
Name: coffee_name, Length: 3547, dtype: object

In [28]:
coffee['coffee_name'].unique()

array(['Latte', 'Hot Chocolate', 'Americano', 'Americano with Milk',
       'Cocoa', 'Cortado', 'Espresso', 'Cappuccino'], dtype=object)

In [29]:
coffee[['cash_type','money','coffee_name','Time_of_Day']]

     cash_type  money    coffee_name Time_of_Day
0         card  38.70          Latte     Morning
1         card  38.70  Hot Chocolate   Afternoon
2         card  38.70  Hot Chocolate   Afternoon
3         card  28.90      Americano   Afternoon
4         card  38.70          Latte   Afternoon
...        ...    ...            ...         ...
3542      card  35.76     Cappuccino     Morning
3543      card  35.76          Cocoa   Afternoon
3544      card  35.76          Cocoa   Afternoon
3545      card  25.96      Americano   Afternoon
3546      card  35.76          Latte       Night

[3547 rows x 4 columns]

In [30]:
coffee.head()

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
0,10,card,38.7,Latte,Morning,Fri,Mar,5,3,2024-03-01,10:15:50.520000
1,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:19:22.539000
2,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:20:18.089000
3,13,card,28.9,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
4,13,card,38.7,Latte,Afternoon,Fri,Mar,5,3,2024-03-01,13:48:14.626000

In [31]:
coffee.loc[0]

hour_of_day                 10
cash_type                 card
money                     38.7
coffee_name              Latte
Time_of_Day            Morning
Weekday                    Fri
Month_name                 Mar
Weekdaysort                  5
Monthsort                    3
Date                2024-03-01
Time           10:15:50.520000
Name: 0, dtype: object

In [32]:
coffee.loc[6]

hour_of_day                 16
cash_type                 card
money                     38.7
coffee_name      Hot Chocolate
Time_of_Day          Afternoon
Weekday                    Fri
Month_name                 Mar
Weekdaysort                  5
Monthsort                    3
Date                2024-03-01
Time           16:19:02.756000
Name: 6, dtype: object

In [33]:
coffee.loc[[3,5]]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
3,13,card,28.9,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
5,15,card,33.8,Americano with Milk,Afternoon,Fri,Mar,5,3,2024-03-01,15:39:47.726000

In [34]:
coffee.loc[[10,45,78]]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
10,19,card,33.8,Americano with Milk,Night,Fri,Mar,5,3,2024-03-01,19:29:17.391000
45,15,card,28.9,Americano,Afternoon,Thu,Mar,4,3,2024-03-07,15:40:22.606000
78,12,card,33.8,Americano with Milk,Afternoon,Tue,Mar,2,3,2024-03-12,12:46:23.275000

In [35]:
coffee.loc[(coffee['coffee_name']=="Americano")]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
3,13,card,28.90,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
11,10,card,28.90,Americano,Morning,Sat,Mar,6,3,2024-03-02,10:22:06.957000
14,14,card,28.90,Americano,Afternoon,Sat,Mar,6,3,2024-03-02,14:38:35.535000
16,17,card,28.90,Americano,Night,Sat,Mar,6,3,2024-03-02,17:34:54.969000
19,12,card,28.90,Americano,Afternoon,Sun,Mar,7,3,2024-03-03,12:26:56.098000
...,...,...,...,...,...,...,...,...,...,...,...
3521,15,card,25.96,Americano,Afternoon,Fri,Mar,5,3,2025-03-21,15:24:42.515000
3528,18,card,25.96,Americano,Night,Fri,Mar,5,3,2025-03-21,18:59:24.271000
3534,12,card,25.96,Americano,Afternoon,Sat,Mar,6,3,2025-03-22,12:25:59.676000
3535,13,card,25.96,Americano,Afternoon,Sat,Mar,6,3,2025-03-22,13:06:21.590000
3545,15,card,25.96,Americano,Afternoon,Sun,Mar,7,3,2025-03-23,15:47:28.723000

In [36]:
coffee.loc[(coffee['coffee_name']=="Americano") & 
           (coffee['Time_of_Day']=="Night")]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
16,17,card,28.90,Americano,Night,Sat,Mar,6,3,2024-03-02,17:34:54.969000
101,18,card,28.90,Americano,Night,Fri,Mar,5,3,2024-03-15,18:19:27.922000
128,17,card,28.90,Americano,Night,Fri,Mar,5,3,2024-03-22,17:17:03.724000
130,17,card,28.90,Americano,Night,Fri,Mar,5,3,2024-03-22,17:20:49.490000
165,17,card,28.90,Americano,Night,Thu,Mar,4,3,2024-03-28,17:27:05.304000
...,...,...,...,...,...,...,...,...,...,...,...
3421,17,card,25.96,Americano,Night,Fri,Mar,5,3,2025-03-14,17:22:14.665000
3424,20,card,25.96,Americano,Night,Fri,Mar,5,3,2025-03-14,20:20:22.022000
3425,21,card,25.96,Americano,Night,Fri,Mar,5,3,2025-03-14,21:40:43.586000
3504,17,card,25.96,Americano,Night,Thu,Mar,4,3,2025-03-20,17:23:51.421000
3528,18,card,25.96,Americano,Night,Fri,Mar,5,3,2025-03-21,18:59:24.271000

In [37]:
coffee.loc[(coffee['coffee_name']=="Americano") & 
           (coffee['Time_of_Day']=="Night") &
           (coffee['Weekday'] != 'Fri')]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
16,17,card,28.90,Americano,Night,Sat,Mar,6,3,2024-03-02,17:34:54.969000
165,17,card,28.90,Americano,Night,Thu,Mar,4,3,2024-03-28,17:27:05.304000
214,18,card,28.90,Americano,Night,Mon,Apr,1,4,2024-04-08,18:18:09.713000
246,17,card,28.90,Americano,Night,Mon,Apr,1,4,2024-04-15,17:01:46.359000
310,17,card,27.92,Americano,Night,Thu,Apr,4,4,2024-04-25,17:09:43.534000
...,...,...,...,...,...,...,...,...,...,...,...
3357,18,card,25.96,Americano,Night,Mon,Mar,1,3,2025-03-10,18:15:54.241000
3386,18,card,25.96,Americano,Night,Wed,Mar,3,3,2025-03-12,18:10:34.209000
3388,18,card,25.96,Americano,Night,Wed,Mar,3,3,2025-03-12,18:24:40.491000
3390,18,card,25.96,Americano,Night,Wed,Mar,3,3,2025-03-12,18:42:13.656000
3504,17,card,25.96,Americano,Night,Thu,Mar,4,3,2025-03-20,17:23:51.421000

In [38]:
coffee.loc[(coffee['Weekday'] == 'Sat') 
           | (coffee['Weekdaysort'] > 5)]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
11,10,card,28.90,Americano,Morning,Sat,Mar,6,3,2024-03-02,10:22:06.957000
12,10,card,33.80,Americano with Milk,Morning,Sat,Mar,6,3,2024-03-02,10:41:41.249000
13,11,card,33.80,Americano with Milk,Morning,Sat,Mar,6,3,2024-03-02,11:59:45.484000
14,14,card,28.90,Americano,Afternoon,Sat,Mar,6,3,2024-03-02,14:38:35.535000
15,16,card,33.80,Americano with Milk,Afternoon,Sat,Mar,6,3,2024-03-02,16:37:24.475000
...,...,...,...,...,...,...,...,...,...,...,...
3542,10,card,35.76,Cappuccino,Morning,Sun,Mar,7,3,2025-03-23,10:34:54.894000
3543,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23,14:43:37.362000
3544,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23,14:44:16.864000
3545,15,card,25.96,Americano,Afternoon,Sun,Mar,7,3,2025-03-23,15:47:28.723000
3546,18,card,35.76,Latte,Night,Sun,Mar,7,3,2025-03-23,18:11:38.635000

In [39]:
coffee.loc[(coffee['Weekday'] == 'Sat') 
           | (coffee['Weekdaysort'] > 5),
           ['cash_type','money']]

     cash_type  money
11        card  28.90
12        card  33.80
13        card  33.80
14        card  28.90
15        card  33.80
...        ...    ...
3542      card  35.76
3543      card  35.76
3544      card  35.76
3545      card  25.96
3546      card  35.76

[889 rows x 2 columns]

In [40]:
#coffee.loc[(coffee.Weekday == 'Sat')] = "Saturday"

In [41]:
coffee.loc[(coffee.Weekday == 'Sat'),['Month_name']] = "March"

In [44]:
coffee.head(12)

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
0,10,card,38.7,Latte,Morning,Fri,Mar,5,3,2024-03-01,10:15:50.520000
1,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:19:22.539000
2,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:20:18.089000
3,13,card,28.9,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
4,13,card,38.7,Latte,Afternoon,Fri,Mar,5,3,2024-03-01,13:48:14.626000
5,15,card,33.8,Americano with Milk,Afternoon,Fri,Mar,5,3,2024-03-01,15:39:47.726000
6,16,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,16:19:02.756000
7,18,card,33.8,Americano with Milk,Night,Fri,Mar,5,3,2024-03-01,18:39:03.580000
8,19,card,38.7,Cocoa,Night,Fri,Mar,5,3,2024-03-01,19:22:01.762000
9,19,card,33.8,Americano with Milk,Night,Fri,Mar,5,3,2024-03-01,19:23:15.887000
10,19,card,33.8,Americano with Milk,Night,Fri,Mar,5,3,2024-03-01,19:29:17.391000
11,10,card,28.9,Americano,Morning,Sat,March,6,3,2024-03-02,10:22:06.957000

In [51]:
coffee.iloc[4]

hour_of_day                 13
cash_type                 card
money                     38.7
coffee_name              Latte
Time_of_Day          Afternoon
Weekday                    Fri
Month_name               March
Weekdaysort                  5
Monthsort                    3
Date                2024-03-01
Time           13:48:14.626000
Name: 4, dtype: object

In [52]:
coffee.iloc[4,6]

'March'

In [53]:
coffee.iloc[4,6] ="Mar"

In [54]:
coffee.iloc[4,6]

'Mar'

In [55]:
coffee.iloc[4:9,1]

4    card
5    card
6    card
7    card
8    card
Name: cash_type, dtype: object

In [56]:
coffee.iloc[4:9,1:3]

  cash_type  money
4      card   38.7
5      card   33.8
6      card   38.7
7      card   33.8
8      card   38.7

In [57]:
coffee.iloc[4:9,6:]

  Month_name  Weekdaysort  Monthsort        Date             Time
4        Mar            5          3  2024-03-01  13:48:14.626000
5        Mar            5          3  2024-03-01  15:39:47.726000
6        Mar            5          3  2024-03-01  16:19:02.756000
7        Mar            5          3  2024-03-01  18:39:03.580000
8        Mar            5          3  2024-03-01  19:22:01.762000

In [58]:
coffee.iloc[:,:]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
0,10,card,38.70,Latte,Morning,Fri,Mar,5,3,2024-03-01,10:15:50.520000
1,12,card,38.70,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:19:22.539000
2,12,card,38.70,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:20:18.089000
3,13,card,28.90,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
4,13,card,38.70,Latte,Afternoon,Fri,Mar,5,3,2024-03-01,13:48:14.626000
...,...,...,...,...,...,...,...,...,...,...,...
3542,10,card,35.76,Cappuccino,Morning,Sun,Mar,7,3,2025-03-23,10:34:54.894000
3543,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23,14:43:37.362000
3544,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23,14:44:16.864000
3545,15,card,25.96,Americano,Afternoon,Sun,Mar,7,3,2025-03-23,15:47:28.723000
3546,18,card,35.76,Latte,Night,Sun,Mar,7,3,2025-03-23,18:11:38.635000

In [59]:
coffee.iloc[:,4]

0         Morning
1       Afternoon
2       Afternoon
3       Afternoon
4       Afternoon
          ...
3542      Morning
3543    Afternoon
3544    Afternoon
3545    Afternoon
3546        Night
Name: Time_of_Day, Length: 3547, dtype: object

In [60]:
coffee.iloc[:,:-1]

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date
0,10,card,38.70,Latte,Morning,Fri,Mar,5,3,2024-03-01
1,12,card,38.70,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01
2,12,card,38.70,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01
3,13,card,28.90,Americano,Afternoon,Fri,Mar,5,3,2024-03-01
4,13,card,38.70,Latte,Afternoon,Fri,Mar,5,3,2024-03-01
...,...,...,...,...,...,...,...,...,...,...
3542,10,card,35.76,Cappuccino,Morning,Sun,Mar,7,3,2025-03-23
3543,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23
3544,14,card,35.76,Cocoa,Afternoon,Sun,Mar,7,3,2025-03-23
3545,15,card,25.96,Americano,Afternoon,Sun,Mar,7,3,2025-03-23
3546,18,card,35.76,Latte,Night,Sun,Mar,7,3,2025-03-23

In [63]:
cl_df = pd.read_csv('df_class.csv',index_col='Unnamed: 0')
cl_df

       Name  Age      City Qualification
0    Khushi   23     Inore           NaN
1  Jayshree   34    Ujjain         B.Com
2      Yash   32       NaN          B.Sc
3     Rohit   54  Shajapur        B.Tech
4    Aditya   23    Bhopal       M.Tech.

In [64]:
cl_df['Gender'] = ['m','f','f','m','f']
cl_df

       Name  Age      City Qualification Gender
0    Khushi   23     Inore           NaN      m
1  Jayshree   34    Ujjain         B.Com      f
2      Yash   32       NaN          B.Sc      f
3     Rohit   54  Shajapur        B.Tech      m
4    Aditya   23    Bhopal       M.Tech.      f

In [67]:
gen = {'m':"Male",'f':'Female'}
cl_df['Map_gender'] = cl_df['Gender'].map(gen)

In [68]:
cl_df

       Name  Age      City Qualification Gender Map_gender
0    Khushi   23     Inore           NaN      m       Male
1  Jayshree   34    Ujjain         B.Com      f     Female
2      Yash   32       NaN          B.Sc      f     Female
3     Rohit   54  Shajapur        B.Tech      m       Male
4    Aditya   23    Bhopal       M.Tech.      f     Female

In [69]:
cl_df['City'].fillna(method = 'bfill',inplace=True)

C:\Users\GrowTech\AppData\Local\Temp\ipykernel_22056\2767810908.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  cl_df['City'].fillna(method = 'bfill',inplace=True)

In [71]:
cl_df['City'].unique()

array(['Inore', 'Ujjain', 'Shajapur', 'Bhopal'], dtype=object)

In [72]:
cl_df['Decode_City'] = cl_df['City'].map({"Inore":'INR',"Ujjain":'UJN',"Shajapur":"SJR","Bhopal":"BPL"})

In [73]:
cl_df

       Name  Age      City Qualification Gender Map_gender Decode_City
0    Khushi   23     Inore           NaN      m       Male         INR
1  Jayshree   34    Ujjain         B.Com      f     Female         UJN
2      Yash   32  Shajapur          B.Sc      f     Female         SJR
3     Rohit   54  Shajapur        B.Tech      m       Male         SJR
4    Aditya   23    Bhopal       M.Tech.      f     Female         BPL

In [76]:
gen = {'m':0,'f':1}
cl_df['Gender'] = cl_df['Gender'].map(gen)

In [77]:
cl_df

,Name,Age,City,Qualification,Gender,Map_gender,Decode_City,Map_gen_num
0,Khushi,23,Inore,NaN,0,Male,INR,0
1,Jayshree,34,Ujjain,B.Com,1,Female,UJN,1
2,Yash,32,Shajapur,B.Sc,1,Female,SJR,1
3,Rohit,54,Shajapur,B.Tech,0,Male,SJR,0
4,Aditya,23,Bhopal,M.Tech.,1,Female,BPL,1

In [80]:
decode_city_dumy = pd.get_dummies(cl_df['Decode_City'],dtype=int)
type(decode_city_dumy)

pandas.core.frame.DataFrame

In [82]:
pd.concat((cl_df,decode_city_dumy),axis=1)

,Name,Age,City,Qualification,Gender,Map_gender,Decode_City,Map_gen_num,BPL,INR,SJR,UJN
0,Khushi,23,Inore,NaN,0,Male,INR,0,0,1,0,0
1,Jayshree,34,Ujjain,B.Com,1,Female,UJN,1,0,0,0,1
2,Yash,32,Shajapur,B.Sc,1,Female,SJR,1,0,0,1,0
3,Rohit,54,Shajapur,B.Tech,0,Male,SJR,0,0,0,1,0
4,Aditya,23,Bhopal,M.Tech.,1,Female,BPL,1,1,0,0,0

In [84]:
def Age_Cat(n):
    if n > 0 and n < 20:
        return 'Teen'
    elif n > 21 and n < 40:
        return "Adult"
    elif n > 41 and n < 75:
        return "Citizen"
    else:
        return "SR Citizen"

In [85]:
cl_df['Age_Cat'] = cl_df['Age'].apply(Age_Cat)
cl_df

,Name,Age,City,Qualification,Gender,Map_gender,Decode_City,Map_gen_num,Age_Cat
0,Khushi,23,Inore,NaN,0,Male,INR,0,Adult
1,Jayshree,34,Ujjain,B.Com,1,Female,UJN,1,Adult
2,Yash,32,Shajapur,B.Sc,1,Female,SJR,1,Adult
3,Rohit,54,Shajapur,B.Tech,0,Male,SJR,0,Citizen
4,Aditya,23,Bhopal,M.Tech.,1,Female,BPL,1,Adult

In [86]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 
                    'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 
                    'value2': [4, 5, 6]})

In [87]:
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [88]:
df2

  key  value2
0   B       4
1   C       5
2   D       6

In [89]:
pd.concat((df1,df2))

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     NaN
0   B     NaN     4.0
1   C     NaN     5.0
2   D     NaN     6.0

In [90]:
pd.concat((df1,df2),axis = 0)

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     NaN
0   B     NaN     4.0
1   C     NaN     5.0
2   D     NaN     6.0

In [91]:
pd.concat((df1,df2),axis = 1)

  key  value1 key  value2
0   A       1   B       4
1   B       2   C       5
2   C       3   D       6

In [92]:
# Merge 
pd.merge(df1,df2,how = 'inner',on = 'key')

  key  value1  value2
0   B       2       4
1   C       3       5

In [93]:
pd.merge(df1,df2,how = 'outer',on = 'key')

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     4.0
2   C     3.0     5.0
3   D     NaN     6.0

In [94]:
pd.merge(df1,df2,how = 'left',on = 'key')

  key  value1  value2
0   A       1     NaN
1   B       2     4.0
2   C       3     5.0

In [95]:
pd.merge(df1,df2,how = 'right',on = 'key')

  key  value1  value2
0   B     2.0       4
1   C     3.0       5
2   D     NaN       6

In [97]:
df1 = pd.DataFrame({'key1': ['A', 'B', 'C'], 
                    'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key2': ['B', 'C', 'D'], 
                    'value2': [4, 5, 6]})

In [98]:
df1.join(df2,how = 'outer')

  key1  value1 key2  value2
0    A       1    B       4
1    B       2    C       5
2    C       3    D       6

In [99]:
df1.join(df2,how = 'inner')

  key1  value1 key2  value2
0    A       1    B       4
1    B       2    C       5
2    C       3    D       6